// Формуємо набір потрібних функцій які ми будемо експортувати. Та зможемо їх імпортувати в тих компонентах яким вони потрібні

// приймає в себе конфігурацію і набір правил для валідації
export function createControl(config, validation) {
  // повертаємо обєкт який схожий з обєктом з Auth
  return {
    // розгортаєм обєкт конфігурації який ми сюди отримуємо, тут може бути велика кількість полів
    ...config,
    // передаємо обєкт validation  
    validation,
    // якщо ми передали набір параметрів валідації то значення valid буде "false", бо є набір правил
    valid: !validation,
    // 
    touched: false,
    // порожня стрічка
    value: ''
  }
}